Revit 2026 API

# WaveWaveColor1 Property

---

The property labeled "Color 1" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveColor1 { get; }
```
```vb
Public Shared ReadOnly Property WaveColor1 As String
	Get
```
```cpp
public:
static property String^ WaveColor1 {
	String^ get ();
}
```
```fsharp
static member WaveColor1 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace